InformationRegisters/ЖурналСервисаПрогнозирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСервисаПрогнозирования</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСостояния</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исходящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕстьОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналСервисаПрогнозирования/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записать информацию об обмене.
// 
// Параметры:
//  ИнформацияОРесурсе - Структура - из:
//   * Метод - Строка -
//   * РесурсСервиса - Строка - 
//   * Заголовки - Строка -  
//  КодСостояния - Строка - 
//  ОтветСервиса - Строка - 
//  ЕстьОшибка - Булево - Есть ошибка
//  Исходящее - Булево - Исходящее
Процедура ЗаписатьИнформациюОбОбмене(ИнформацияОРесурсе, КодСостояния, ОтветСервиса, ЕстьОшибка = Ложь, Исходящее = Истина) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.ЖурналСервисаПрогнозирования");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЖурналСервисаПрогнозирования.НомерСообщения КАК НомерСообщения
		|ИЗ
		|	РегистрСведений.ЖурналСервисаПрогнозирования КАК ЖурналСервисаПрогнозирования
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСообщения УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 0 Тогда
			Выборка.Следующий();
			НомерСообщенияОбмена = Выборка.НомерСообщения + 1;
		Иначе
			НомерСообщенияОбмена = 0;
		КонецЕсли;
		
		ТекущаяДата = ТекущаяДатаСеанса();
		
		Набор = РегистрыСведений.ЖурналСервисаПрогнозирования.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(ТекущаяДата);
		Набор.Отбор.НомерСообщения.Установить(НомерСообщенияОбмена);
		Набор.Отбор.Исходящее.Установить(Исходящее);
		Набор.Отбор.ЕстьОшибка.Установить(ЕстьОшибка);
		
		Запись = Набор.Добавить();
		Запись.Период = ТекущаяДата;
		Запись.НомерСообщения = НомерСообщенияОбмена;
		Запись.ТекстСообщения = ОтветСервиса;
		Запись.КодСостояния = КодСостояния;
		Запись.ЕстьОшибка = ЕстьОшибка;
		Запись.Исходящее = Исходящее;
		Запись.Метод = ИнформацияОРесурсе.Метод;
		Запись.РесурсСервиса = ИнформацияОРесурсе.РесурсСервиса;
		Запись.Заголовки = ИнформацияОРесурсе.Заголовки;
		
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СобытиеЖурналаРегистрации = СервисПрогнозированияПереопределяемый.ТекстСобытиеЖурналаРегистрации();
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрации,
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ЖурналСервисаПрогнозирования,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
